21-route-helpers/rails-app/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"
---
    def index
        @pets = Pet.all

UPDATE "pets" SET "noise" = ?, "owner_id" = ? WHERE "pets"."id" = ?  [["noise", ""], ["owner_id", 4], ["id", 101]]
---
    def update
        @pet = Pet.find_by({ id: params[:id] })
        @pet.update(filtered_params[:pet])