20-rails/rails-app/app/controllers/pets_controller.rb

    def get_pets
        @pets = Pet.all
---
SELECT "pets".* FROM "pets"

    def update
        @pet = Pet.find_by({ id: params[:id] })
        @pet.update(filtered_params[:pet])
---
UPDATE "pets" SET "name" = ? WHERE "pets"."id" = ?  [["name", "Sunday!"], ["id", 3]]