24-authentication/rails-app/app/views/pets/edit.erb

SELECT "owners".* FROM "owners"
---
        <select name="pet[owner_id]">
            <% Owner.all.each do | owner | %>