22-form-helpers/rails-app/app/controllers/pets_controller.rb

    def index
        @pets = Pet.all
---
SELECT "pets".* FROM "pets"

    def edit
        @owners = Owner.all
---
SELECT "owners".* FROM "owners"

    def update
        @pet = Pet.find_by({ id: params[:id] })
        @pet.update(filtered_params[:pet])
---
UPDATE "pets" SET "noise" = ?, "owner_id" = ? WHERE "pets"."id" = ?  [["noise", ""], ["owner_id", 4], ["id", 101]]