23-cookies-and-sessions/rails-quest/app/views/responses/new.html.erb

    <label>Choices:</label>
    <% @question.random_answers.each do | answer | %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY RANDOM()  [["question_id", 59]]