21-route-helpers/rails-app/app/views/pets/show.erb

SELECT "owners".* FROM "owners"
---
        <select name="pet[owner_id]">
            <% Owner.all.each do | owner | %>