24-authentication/rails-app/app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners" WHERE "owners"."name" = ? LIMIT ?  [["name", "fabi"], ["LIMIT", 1]]
---
    def auth
        owner = Owner.find_by({ name: params[:name]})