24-authentication/rails-app/app/controllers/pets_controller.rb

    def edit
        @owners = Owner.all
---
SELECT "owners".* FROM "owners"

    def update
        if session[:owner_id] != nil
            @pet = Pet.find_by({ id: params[:id] })
            if @pet.owner_id == session[:owner_id]
                @pet.update(filtered_params[:pet])
---
UPDATE "pets" SET "noise" = ?, "owner_id" = ? WHERE "pets"."id" = ?  [["noise", ""], ["owner_id", 4], ["id", 101]]