25-validation/rails-app/app/views/pets/new.erb

        <select name="pet[owner_id]">
            <% Owner.all.each do | owner | %>
---
SELECT "owners".* FROM "owners"