23-cookies-and-sessions/rails-quest/app/controllers/responses_controller.rb

    def new
        @message = flash[:message]
        @number_correct=  session[:number_correct]
        @question = Question.all.sample
---
SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

    def create
        if session[:number_correct] == nil
            session[:number_correct] = 0
        end
        @number_correct = session[:number_correct]
        response = Response.create(filtered_params[:response])
---
INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 53], ["answer_id", 209], ["created_at", "2019-06-11 15:13:04.303534"], ["updated_at", "2019-06-11 15:13:04.303534"]]