25-validation/rails-app/app/controllers/pets_controller.rb

    def create
        pet = Pet.create(filtered_params[:pet])
---
INSERT INTO "pets" ("name", "noise", "owner_id") VALUES (?, ?, ?)  [["name", "Tess"], ["noise", "Ruff"], ["owner_id", 5]]

    def edit
        @owners = Owner.all
---
SELECT "owners".* FROM "owners"

    def update
        @pet = Pet.find_by({ id: params[:id] })
        @pet.update(filtered_params[:pet])
---
UPDATE "pets" SET "name" = ?, "owner_id" = ? WHERE "pets"."id" = ?  [["name", ""], ["owner_id", 3], ["id", 102]]